[
    {
        "tweet_url":"https:\/\/x.com\/elonmusk\/status\/1838021324045766931",
        "comments":[
            [
                "As always..it always leads back to Obama when he helped nullify the Smith-Mundt Act of 1948 in 2013 to make it legal to propagandize Americans..Nothing is coincidence.",
                [
                    "Positive",
                    0.1
                ]
            ],
            [
                "Friends don't let friends believe Trump is racist",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "People loved Donald Trump until he was a threat to the establishment in DC.",
                [
                    "Positive",
                    0.7
                ]
            ],
            [
                "We've got the receipts that Donald J. Trump has NEVER been a racist",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "They are poisoning the blood of our country! Is that racist? \n\nI never really thought Trump was racist and if he is, it’s not why I think he is the worst and most flawed human being to ever sit in the Oval Office.\n\nBut Trump is; \n\nA malignant Pathological liar. Not just a liar",
                [
                    "Negative",
                    -0.22
                ]
            ],
            [
                "Leftists don't care about the truth, they only care about being morally superior.\n\nTaking this hoax away from them is like taking alcohol away from a drunk. They'll fight you the whole way.",
                [
                    "Positive",
                    0.1
                ]
            ]
        ],
        "positive_comments":50.0,
        "negative_comments":50.0
    },
    {
        "tweet_url":"https:\/\/x.com\/elonmusk\/status\/1837842969002754235",
        "comments":[
            [
                "I thought he was racist from all the Mexicans(im half Mexican btw) saying on repeat that “he’s racist” “he wants to deport us” “he’s gonna build a wall and make mexico pay for it”. But eventually I would see videos of him being a wholesale guy and I listened to all the things he",
                [
                    "Positive",
                    0.01
                ]
            ],
            [
                "Great info",
                [
                    "Positive",
                    0.8
                ]
            ],
            [
                "I’d like to follow him. This was a great video.",
                [
                    "Positive",
                    0.8
                ]
            ],
            [
                "Who is this?  What is his x handle or YouTube handle?",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Who is this guy?  He’s an amazing communicator.",
                [
                    "Positive",
                    0.6
                ]
            ],
            [
                "Do we have a name to go with that video? I would like to credit the man with this amazing speech.  Everyone needs to see it.",
                [
                    "Positive",
                    0.6
                ]
            ],
            [
                "That storyline was debunked long long ago by white people. But now that a black guy explains it. It’s a revelation. Give me a break.",
                [
                    "Negative",
                    -0.07
                ]
            ],
            [
                "Very good!",
                [
                    "Positive",
                    1.0
                ]
            ],
            [
                "Propaganda baby propaganda.",
                [
                    "Negative",
                    -0.1
                ]
            ],
            [
                "Who is this young man? When you find out, can you edit your post to include him?",
                [
                    "Positive",
                    0.1
                ]
            ],
            [
                "Who is this man??",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "What is the video creator's name? Anyone know?",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Bravo, good man!",
                [
                    "Positive",
                    0.88
                ]
            ],
            [
                "",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Just saw this on my FYP on TikTok! The effort he made to make this is phenomenal.",
                [
                    "Positive",
                    0.5
                ]
            ],
            [
                "Good message. Thank you!",
                [
                    "Positive",
                    0.88
                ]
            ],
            [
                "My moment was when i seen a video of all of the legacy news networks stating that they were the only unbiased trusted news network station, word for word and literally identical to all the other networks very clearly reading a script given to them. Which lead me to notice other",
                [
                    "Negative",
                    -0.03
                ]
            ],
            [
                "Then there's this...\nTop staff on Mark Robinson’s campaign team have resigned from their roles, the campaign announced Sunday, three days after the embattled Republican candidate for North Carolina governor denied making years-old salacious posts on a pornagraphic website.",
                [
                    "Positive",
                    0.5
                ]
            ]
        ],
        "positive_comments":61.11,
        "negative_comments":38.89
    }
]