[
    {
        "VideoID":"yAvG9YHJMAs",
        "comments":[
            [
                "John 14:6 NKJV\r\n6 Jesus said to him, “I am (A)the way, (B)the truth, and (C)the life. (D)No one comes to the Father (E)except through Me.\r\n\r\n*Did you know you’re part of the ultimate statistics, 10 out of 10 people die. One day your heart will stop beating and you will be dead! The Bible says you’ll then be judged by the holy and righteous God who created this universe.(Hebrew 9:27)You’ll be judged for every word, thought, and action in your life.(Matthew 12:36-37) Will you be innocent or guilty?\r\n\r\n*Let’s check the standard, the Ten Commandments. Have you ever lied (even a “white” lie)? (Revelation 21:8) Have you ever stolen anything (value is irrelevant and includes downloading or copying movies illegally)?  If you’ve lusted, you’ve committed adultery in your heart. (Matthew 5:27-30) (1 Corinthians 6:9-10)\r\n\r\nIf you’ve hated someone, the Bible says you’re a murderer(1 John 3:15). If you’ve done any of these things, you will be guilty, and end up in Hell. God is perfect and He hates sin, but He sent His Son, Jesus Christ, to die on the Cross to take the punishment you deserve. Then He rose from the graves after three days  – defeating death. (Luke 24:46-48)\r\n\r\nRepent (turn from your sins) and trust in Jesus Christ our Lord and saviour  to receive forgiveness and everlasting life afterlife here on earth without pain, suffering and death anymore (revelation 21:4) God cannot Lie He is holy, Righteous and just cannot tolerate Sin(Hebrew 6:18) if you don’t believe in God you are making God a liar. Think about it.\r\n\r\nDo you think God cannot preserve His words ? He created the heaven and the earth and the sea all living things here on earth including human.\r\n\r\n. Read the Bible to learn about God and how to live. (Acts 20:21) \r\n\r\n*Do God’s will, plan and purpose in your life; these are above and beyond, immeasurable compare to your grandest dream.\r\n\r\n* We obey God’s moral law the Ten Commandments because we love our Lord and saviour Jesus Christ, the Father and the Holy Ghost(John 14:15) (John 14:1-6) (John 14:16-26) (Mark 12:30-31)  with all our heart, soul, mind and all our strength, and we believe and have faith in Him; also we Fear Him with reverence with deep respect. \r\n\r\nJob 28:28\r\nKing James Version\r\n28 And unto man he said, Behold, the fear of the Lord, that is wisdom; and to depart from evil is understanding.\r\n\r\n1 Corinthians 6:9-10\r\nNew King James Version\r\n9 Do you not know that the unrighteous will not inherit the kingdom of God? Do not be deceived. (A)Neither fornicators, nor idolaters, nor adulterers, nor [a]homosexuals, nor [b]sodomites, 10 nor thieves, nor covetous, nor drunkards, nor revilers, nor extortioners will inherit the kingdom of God.\r\n\r\nEcclesiastes 12:13-14\r\nNew King James Version\r\n13 Let us hear the conclusion of the whole matter:\r\n\r\n(A)Fear God and keep His commandments,\r\nFor this is man’s all.\r\n14 For (B)God will bring every work into judgment,\r\nIncluding every secret thing,\r\nWhether good or evil.\r\n\r\n* Let’s seek the Lord and His face also His strength, power, wisdom and discernment in our daily lives.\r\n\r\nWe need God’s help to overcome Sin in our lives. And live a holy life in the eyes of the Living God. \r\n\r\nGod will help us if we seek Him diligently with all our heart, soul, mind and all our strength .\r\n\r\nPut on always the full armour of God (Ephesians 6:10-18)\r\n\r\nPhilippians 4:13\r\nNew King James Version\r\n13 I can do all things (A)through [a]Christ who strengthens me.\r\n\r\nPsalm 28:7\r\nNew King James Version\r\n7 The Lord is (A)my strength and my shield;\r\nMy heart (B)trusted in Him, and I am helped;\r\nTherefore my heart greatly rejoices,\r\nAnd with my song I will praise Him.\r\n\r\nActs 20:21\r\nKing James Version\r\n21 Testifying both to the Jews, and also to the Greeks, repentance toward God, and faith toward our Lord Jesus Christ.\r\n\r\nGod bless.\r\n\r\n\r\nLiving water.",
                [
                    "Negative",
                    0
                ]
            ],
            [
                "Thomas Linda Jackson Jason Lewis Margaret",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "💯💮🈵🈵🈵🈹🈹🆑🆎🆑🆑🆑🆎🆑🆑🆑🆑🆑🆑🆑🛑🛑🛑💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢💢❎❎🈯️🈯️✅🈯️🈯️🈯️🈯️🈯️🈯️🈯️✅🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️🈯️✅‼️⁉️🔅⁉️🔅🚸🚸🔱🔱🔱🚸🚸🔱🔱🚸🔱🔱🔱🔱🔅🔅🔅🔅🔅❕❕❕⁉️‼️❔❔❔〽️〽️〽️〽️❇️🧑‍🧒🔤1️⃣🔢⏮️✖️✖️✖️✖️✖️🟰✖️🟰🟰🟰🟰©️©️©️©️©️™️™️™️™️™️™️©️©️©️©️🟰🎶🎶🎶🎶🎶✖️🎵🎶✖️🎵🫠🫠🫤🫠🫤🤥🤥🤥😎😎😎😎😎🥸🥸🥸🤩🤩🤩🥳🥳🥳🥳🥳🤩🤩🥳🥳🙃🙃😘😘🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙃🙂🙃🙃🙂🙃🙃🙃🙃🙂🙃🙃🙃😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😘😛😘😘😘😛😛😛😛😛😘😘😘😘😘",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Literally Trump could rationalize out of anything - flip back on his own logic - and his supporters like blindly just follow his lead. Grow a spine. You can like Trump but if you can’t see the hypocrisy between trump asking for a 2nd debate against Biden and how him dodging a second debate with Harris…you are experiencing the blind trust that occurs in cults",
                [
                    "Negative",
                    -0.07
                ]
            ],
            [
                "I like 💖 the we post thing 🙂 and you got mentioned by Donald Trump because you get under his skin 😔 like other Jimmy he is not 🚫 only getting under his skin 😭 but pissed him off 😡🤣",
                [
                    "Negative",
                    -0.06
                ]
            ],
            [
                "First, you lefties are not fair, she will get her questions and answers before the debate, secondly; Trump has also to debate the moderators",
                [
                    "Negative",
                    -0.03
                ]
            ],
            [
                "when you make fun of old people, you sound like a douche",
                [
                    "Positive",
                    0.27
                ]
            ],
            [
                "Hilarious😂",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Supported Defunding the Police: Kamala Harris backed the movement to defund the police, threatening the safety of communities nationwide.¹\n‍\n‍\n\n￼\n\nBailed Out Violent Criminals: When Minneapolis was in flames, Harris encouraged donations to bail funds, effectively freeing those who destroyed small businesses and endangered lives.²\n‍\n\n￼\n\nPushes for Gun Confiscation: Harris advocates for a mandatory buy-back of firearms, leaving citizens defenseless against violent criminals.³\n‍\n‍\n\n￼\n\nSupported Defunding ICE: As a Senator, Kamala Harris tried to take $220 million out of ICE’s Enforcement Division.⁴\n‍\n‍\n‍\n\n￼\n\nTreats Law-Abiding Citizens as Criminals: Under Harris’ policies, everyday Americans are treated like criminals, while actual perpetrators of violent crime get a free pass.⁵\n‍",
                [
                    "Negative",
                    -0.25
                ]
            ],
            [
                "4:10 \nWhen have to choose between eggs and the doctor in this economy of course you won't. When you're paid to be a shill you can afford the pill.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "3:15 \nThat's funny because they're contracted pilots for hire.",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "Looks like Chuck like to $u€k. I guess $20 os $20, huh? He doesn't need to debate her, because everytime she opens her mouth, she loses support.",
                [
                    "Negative",
                    -0.3
                ]
            ],
            [
                "YOU ARE WHAT YOU EAT. Cluck, cluck, cluck!  Trump Orange Fried Chicken!",
                [
                    "Negative",
                    -0.75
                ]
            ],
            [
                "Jimmy Fallen your a moron. Trump is not afraid. Why should he debate her after the way he was treated in the last debate?? No one with a brain would want to put themselves in that position! No one believes she is winning in the poles. He's doing great reaching people at his rally's. I stand with Donald Trump. Kamala is a jack ass and she knows she is losing. Jimmy Fallen used to be good, now he is a big fool just like Kamala is!",
                [
                    "Positive",
                    0.21
                ]
            ],
            [
                "forget the criminality, the punk is just a moron, IQ78, about 11 points under the national average",
                [
                    "Negative",
                    -0.48
                ]
            ],
            [
                "2:27 Send the has-been to Dancing with the Stars.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Jimmy Fallon not funny 😢",
                [
                    "Negative",
                    -0.12
                ]
            ],
            [
                "Maybe she wants another debate because not everyone even knows who she is. We already know who trump is. Honestly I forgot about her throuout Bidens administration. Therefore, I have no idea what good she's done for our country.",
                [
                    "Positive",
                    0.5
                ]
            ],
            [
                "Fake Ke mala",
                [
                    "Negative",
                    -0.5
                ]
            ],
            [
                "Kamala is the worst person for president, but since the elite and celebrities endorsed her we are supposed to believe she is fantastic! So pathetic",
                [
                    "Negative",
                    -0.5
                ]
            ],
            [
                "Actually if you added up every item on the Cheesecake Factory menu I’m pretty sure it’s well over 15,000 pounds in cost",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "FASCIST 🍄 🇷🇺 ☠️ 🇨🇳 FAKE BONE SPURS  , tRump",
                [
                    "Negative",
                    -0.5
                ]
            ],
            [
                "She  already win why she need another! 😂😂😂😂😂",
                [
                    "Positive",
                    1.0
                ]
            ],
            [
                "She  already win why she need another! 😂😂😂😂😂",
                [
                    "Positive",
                    1.0
                ]
            ],
            [
                "And the Pope thinks he is God for pulling that off?\r\nLike the UN which he Holy oversees?\r\nUsing the money of nations to finance his global operation?\r\n\r\nAnd the racial mix of nations too?  \r\n\r\nAnd the operation of Climate Change?\r\n\r\nAnd the Two-State Solution?\r\n\r\nAnd the Final Solution?\r\n\r\nAnd he selects government elections?\r\n\r\nAnd the distribution of welfare?\r\n\r\nAnd the Medical winners and losers?\r\n\r\nAnd his Democratic kingdom pushes for it, collectively?  \r\n\r\nAnd he rules over all of it?\r\n\r\nAnd you pay for it?\r\n\r\n\r\n(For Eva.)",
                [
                    "Negative",
                    -0.05
                ]
            ],
            [
                "I remember when Jimmy Fallon (and the rest of the late night hosts) were actually funny. Good ole days.",
                [
                    "Positive",
                    0.22
                ]
            ],
            [
                "In my opinion, Kamala should invite Trump to a debate on Fox where he has a chance to attract new voters and Trump will have to accept it...",
                [
                    "Positive",
                    0.14
                ]
            ],
            [
                "Jimmy ate to many Oestrogen Pills",
                [
                    "Positive",
                    0.5
                ]
            ],
            [
                "my backsplash is so much prettier. more better.",
                [
                    "Positive",
                    0.4
                ]
            ],
            [
                "No hes not he just doesn't want to debate kamala and the moderators and abc so they can cheat give her the questions and an ear piece!",
                [
                    "Negative",
                    0.0
                ]
            ]
        ],
        "srt":"Welcome, everybody. Welcome, welcome, welcome\nto \"The Tonight Show.\" You're here. You made it.\nThank you for watching at home. Well, guys, it's an exciting\ntime to be in New York City because over 140 world leaders just arrived here\nfor the UN General Assembly. -[ Cheers and applause ]\n-Yeah. Yeah. If you love the sound\nof car horns, police sirens, and New Yorkers\ncursing at motorcades, this is the week for you! Yes! [ Cheers and applause ] Yep, due to heavy traffic, all New Yorkers\nare being encouraged to take public transit. So instead of sitting\nin a car that's not moving, now you can sit on a train\nthat's not moving, so... Well, New York City officials\nactually said drivers should expect\nthe slowest traffic of the year. Yeah, you know, traffic is slow\nwhen even Biden is like, \"You know what? I'm just\ngonna get out and walk.\" Uh... [ Laughter ] Yeah, earlier today,\nPresident Biden attended the General Assembly and delivered\nhis final U.N. address. Biden called on nations to band\ntogether amid world conflicts and growing concerns\nover China's influence. Then he added,\n\"Or do whatever you want. What the hell do I care?\nI don't... I don't care anymore.\" Biden's address was a big deal. It's the most important speech\nhe's delivered in front of a 1990s\nkitchen backsplash. [ Laughter ] ♪♪ That's a home-improvement\nHGTV joke. Yeah. Some more political news. A new poll found\nthat 64% of people want to see another debate between Kamala Harris\nand Donald Trump... while the other 36%\nare Donald Trump. [ Laughter ] [ Applause ] [as Trump]\n\"I'm good. I'm totally good. No, thanks!\" Yep, Harris agreed\nto a second debate, but Trump's excuse\nwas that since early voting has already started,\nit's too late. Well, it turns out Trump is\nusing a special excuse generator to help him\nget out of these things. Let me show you how it works. When asked if he'd do a second\ndebate with Kamala Harris, Trump said... [ Beeping ] See? So...\nIt works like that. So then he tried another excuse.\nHe said... [ Beeping ] [ Laughter ] He got out of it. After that, Trump said... [ Beeping ] You know, that's... I mean, we need -- This is\nthe time of year to do it. Here's another one. He said... [ Beeping ] And finally, Trump said... [ Beeping ] And so he just has\na lot of excuses. He's busy. [ Applause ] Well, some news\nfrom Washington today. The CEO of the company\nthat makes Ozempic testified before Congress, and he was grilled\nover the drug's high price. Yeah, they were gonna roast him,\nbut grilling is healthier. [ Laughter ] ♪♪ Some more business news. Southwest Airlines\ntold its staff that the company will have to\nmake \"difficult decisions\" to boost profits. Yeah, today the CEO walked\ninto the cockpit and said, \"Sorry, guys.\nIt's your last day.\" And the pilots were like, \"That's okay.\nWe don't work here.\" [ Laughter ] Well, listen to this.\nI read that California is suing ExxonMobil\nfor allegedly not recycling\n95% of their plastic waste. -Ooh.\n-That just makes me sick. I mean, if you can't trust\na big oil company to protect the environment,\nthen who can you trust? You know what I'm saying?\nCome on, man. [ Cheers and applause ] [ Chuckles ] Some entertainment news.\nKevin Costner just hinted that he might return\nto \"Yellowstone.\" -Ooh. Ohh!\n-Yeah. Costner may have finally made up\nwith the show's creator. When they heard,\nthe United Nations was like, \"Well, our work here is done.\nTake care, everybody.\" Well, get this.\nAccording to a new survey, two out of five Gen Z men don't\nhave a primary care doctor. Instead, they just create\nthe hashtag #DoesThisLookInfected. [ Laughter ] Well, this is wild. I saw\nthat a cream-cheese festival in New York just served\nthe world's largest cheesecake at 15,000 pounds. [ Audience oohs ] 15,000 pounds of cheesecake, which is almost as heavy as the\nmenu at the Cheesecake Factory. Almost. Finally, guys, it is Tuesday. It's time for \"WePost.\"\nHere we go! -♪ WePost ♪ ♪ WePost ♪ -Welcome to \"WePost.\" This is where we as a group\ndecide something we should post on socials. I'm going to show you\nfive different posts and we're all going to vote on whether you like\neach one or not. You all have voting clickers\nat your seats? Yeah, you see them? You can vote for all of them\nif you want. You can vote for none of them. Whatever you want to do.\nAnd we'll see the results live. Higgins, Roots, you guys\nall have clickers, too. I'm going to post whichever one\ngets the most likes from all of us -- because it's\nnot a MePost, it's a WePost. [ Audience awws ] [Voice breaking] Thank you.\n[ Laughter ] Uh, you guys ready for this?\n[ Audience cheers ] Alright. First post is... Everybody in the club\ngettin' crispy. Yes. What do you think? It's a little crispy out there. Alright. The votes are in.\nLet's see the results here. Alright. Not bad, not bad.\nVery nice. You're being very nice.\nI appreciate that. Thank you. Let's try this\nnext one here. It says... I don't care where I am as long\nas I'm not involved with that. [ Laughter ] He looks like one of the --\nHe had to take his shoes off. -Yeah.\n-He's gonna go for it. Yeah. -Sockless.\n-Sockless. Control the volume with his --\nYeah, yeah. Let's see the results\non this one. Wow!\n-Wow! ♪♪ -That's it!\n-That's off the charts! -That's actually off the chart.\n-Oh, my gosh! 190! -Wow! That one hit home, man.\nYeah. Well done. -Wow.\n-That's an all-time high. -That's an all-time high. Yeah. It's a Rita Coolidge\nshout-out there. Yeah. [ Laughter ]\nAlright. How about this next one here?\nIt says... -Deep cut! -I don't know if you're\ngonna top that other one. I don't know if that's...\n-That airline one was so good. I'm kind of riding\nthat all-time high there. Alright, let's see\nthe results on this one. I don't think so.\nYeah, yeah, yeah. Alright. Good.\nAt least we know -- At least we know these work.\nYeah. They're real. [ Laughter ] How about this one?\nNext up, it says... -Hmm.\n-[ Laughter ] -Think about it.\n-I guess so. I don't know.\n-Vaping maybe. Yeah. -I don't know. Vaping?\n-No one looks hot -- No one looks cool vaping.\nNo one. -No one looks cool vaping?\n-Yes. Salad, though... -No one looks hot\neating a salad. No one looks hot really eating.\n-Yeah. -Well, except for, like...\n-[ Cackles ] Smells like summer. -No, I was gonna say, like... I was gonna say Guy Fieri\nor something. -Yeah.\n-Those food people, they do it. They professionally, like,\nchomp into something. -Yeah, they're\nprofessional eaters. -They take their time.\n-Joey Chestnut. -Joey Chestnut.\nHe doesn't even eat anything. He just swallows everything.\n-No, he swallows, yeah. -Which one of those guys --\nJoey -- One of the hot-dog guys,\nhe went vegan. -Kobayashi.\n-Kobayashi. He doesn't even eat meat\nanymore. -Yeah, he doesn't even\nwant to competitive -- He just wants to eat normal now. -Yeah. He wears that T-shirt.\n-What is his T-shirt? -\"No one looks hot\neating a hot dog.\" He does not.\n-[ Laughter ] Alright. I don't have\na good feeling about this, but let's see the results\non this one here. Yeah, yeah, yeah, I agree. ♪♪ Okay. This next one's not bad. -Okay.\n-This one's got a chance. -Really?\n-This one's got a chance\nto beat the other. The other one's pretty good,\nthough. Everyone can relate\nto that thing, sitting next to the weird person, yeah,\nbut this one's decent. Okay, here. This one says... [ Laughter ] -Whoa-oa-oa! -You go, \"Hey, how's it going?\nWhoa! Oh, my goodness. Sorry.\nWow. This is great. Where'd you get this thing?\" Alright, let's see\nthe results on this one. Can it beat 190? I don't know. -Oh, my gosh! Oh!\n-By one? Oh, my gosh! That's it.\nWe're going with number two. Number two\nis our winner right here. I'm gonna post this\nduring the break. If you happen to see it online,\ngive that WePost a repost. We have a great show. Keith Urban is here\nto talk and perform! Margaret Qualley\nis joining us! Oh, we love it. Stick around. We're playing\nPictionary when we come back. ",
        "positive_comments":36.67,
        "negative_comments":63.33,
        "sentiment":"Positive",
        "intensity":0.17
    },
    {
        "VideoID":"CdoOUAE71Ow",
        "comments":[
            [
                "If Trump wins the election..you're finished as a democratic country!..Period!..shouldn't be even on the ballot for what he's doing and continues to do!",
                [
                    "Positive",
                    0.38
                ]
            ],
            [
                "Tous vacciné tous PROTEGE  les endormis !!!!???? Corompu  RASKIN!!! 👹",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Oh wow your not even good at talking smack anymore..good luck",
                [
                    "Positive",
                    0.4
                ]
            ],
            [
                "Decades ago, Republicans realized they were losing elections on policy.  Instead of revisiting their policies and revamping them and their GOP platform to appeal to a modern audience, a broader electorate, they came up with the \"Culture Wars\" instead and also made voting harder not easier.",
                [
                    "Positive",
                    0.05
                ]
            ],
            [
                "The Republicans are the ones cheating.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "IRONICALLY THE DEFINITION OF WHAT CONSTITUTES \"THE STATE\" IS THIS :- The superstructure of the State is the Judiciary and the Political - WHO CONTROLS BOTH OF THESE NOW - THE MAGA STOOGES!!MAGA CONTROLS THE STATE - THE DEEP STATE IS MAGA AND ITS ALREADY IN PLACE THATS WHY ITS SO DIFFICULT TO GET RID OF THEM.",
                [
                    "Negative",
                    -0.17
                ]
            ],
            [
                "Read up on Hitler's \"Night if the Long Knives,\" June 30-July 1, 1934.\nThousands were murdered.  That was Hitler going after his critics and rivals.\nThe Big Crackpot (Trump) is known to admire ruthless dictators, and desperately wants to be one himself.\nTrump's path to power resembles Hitler's in many respects.  Trump will not hesitate to use violence.  Remember his \"bloodbath\" speech.",
                [
                    "Negative",
                    -0.07
                ]
            ],
            [
                "The OLD FELON’s toxicity just keeps growing and getting worse, and after the destructive violence of January 6th I’m frightened to think 🤔 he could throw America into 1930s Germany. If Judge Merchan had sentenced him when he should have after “WE THE PEOPLE” found him guilty, he’d be in prison where he belongs! Am so sick of judges not treating him like any other mob criminal!😡",
                [
                    "Negative",
                    -0.39
                ]
            ],
            [
                "Stimmied? Really? The Y in stymied is pronounced like the Y in why. C'mon",
                [
                    "Positive",
                    0.2
                ]
            ],
            [
                "I wondered why the Dems haven't been mentioning these crimes he did in office!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Stop lying,clowns.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Raskin is a rascal a liar a blinded weak minded leader thats going nowhere but down to the to his own lies and deception this woman is completely deceived a liar the blind trying to lead other blind people her judgement will be greater because she is a liar very dark person",
                [
                    "Negative",
                    -0.07
                ]
            ],
            [
                "SCARY . How so!",
                [
                    "Negative",
                    -0.62
                ]
            ],
            [
                "Why not? If you're not guilty, what is there to be afraid of. Too much -------  here on MSNBC.",
                [
                    "Negative",
                    -0.05
                ]
            ],
            [
                "Take him out, to the hospital. Take him out, of all politics. Take him out, to the woodshed. Take him out, to prison. Take him out, of this country. Take him seriously, so just VOTE him! out!",
                [
                    "Negative",
                    -0.52
                ]
            ],
            [
                "Donald trump said he ll go after by who cheated election he ll pin on democrats!! But democrat will get real evidence and proof come from Donald trump himself cheat the election again he avoided lots more lies to stay out of prison because of more charges will bring up against Donald trump who trying to steal election fraud again like in 2020 !!!! Vote blue 💙 so we can get Donald trump in prison for good to avoid this country will be lots more corrupt and worse dangerous!!! We don’t need this from Donald trump to be dictator again !!! Enough is enough!!!!!!",
                [
                    "Positive",
                    0.09
                ]
            ],
            [
                "So clearly Trump can’t do that so he was letting off steam. \n\nClinton and Comey, they were guilty of the Russia hoax creation; so not like there wasn’t cause. \n\nHowever, Trump didn’t do that, but Biden and Harris did.",
                [
                    "Negative",
                    -0.2
                ]
            ],
            [
                "Rep. Raskin...think of you so often. May your son s memory be a blessing. Praying for your continuing good health. You are a national treasure.\n❤ you Jen.",
                [
                    "Positive",
                    0.7
                ]
            ],
            [
                "TRUMP WILL BE SENTENCED ON NOVEMBER 26TH.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Trump is as stupid as stupid can get, his entire life has been a lie, people need to read Mary Trump's book, telling us about Trump's sociopathic behavior, about how he went through his fathers gift money, of $413 million, and the $200 million he received from the sale of Fred's assets after his father died.  He still managed to go bankrupted 6 times, and he even sent 2 casinos broke, and put $7.9 trillion on the countries credit card as President.  He is a terrible businessman.",
                [
                    "Negative",
                    -0.65
                ]
            ],
            [
                "It sounds to me like he is threatening not just political actors but to common voters as well, if they are registered as Democrats",
                [
                    "Negative",
                    -0.15
                ]
            ],
            [
                "Fact is: Also Republican voters are much better of if they vote for Kamala  Harris instead of weird immoral con artist Donald Trump",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Is everyone aware that Trump's campaign plane is \"The Lolita Express\" - Epstein's plane?",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "Only a wannabe dictator would think that way in my opinion",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Why is Trump not in jail,",
                [
                    "Negative",
                    -0.1
                ]
            ],
            [
                "Vote blue all the way down. I am a Canadian, never run after a rat when your home is on fire, and remember people with small mouths are talkertives and lies a lot. Vote blue all the way down.",
                [
                    "Negative",
                    -0.11
                ]
            ],
            [
                "Well he has free reign now.  NO consequences for almost any action he chooses to take.",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "He is a dangerous person.  Can’t stand to look at him anymore.",
                [
                    "Negative",
                    -0.6
                ]
            ],
            [
                "This is what The Biden administration did do and your hair is Red. looks good.",
                [
                    "Positive",
                    0.35
                ]
            ],
            [
                "Dirty tricks are crime.",
                [
                    "Negative",
                    -0.6
                ]
            ]
        ],
        "srt":"no element found: line 1, column 0",
        "positive_comments":30.0,
        "negative_comments":70.0,
        "sentiment":"Negative",
        "intensity":0.0
    },
    {
        "VideoID":"DV4TubkM-8U",
        "comments":[
            [
                "He'd be a better president than Trump !",
                [
                    "Positive",
                    0.62
                ]
            ],
            [
                "Pre planned miss huh 😂",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "CIA and Blackrock all over it!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "It takes us back to what jd Vance said he’s Hitler!!!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "He didn’t even try! At least try!!",
                [
                    "Negative",
                    -0.47
                ]
            ],
            [
                "Donald Trump  needs to step down,  because this is the seconded attempt  on his life..  .wow...",
                [
                    "Negative",
                    -0.16
                ]
            ],
            [
                "Rxoth is my dawg... miss him sm. Dunkno",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Would be funny that Trump be desperate enough to gain sympathy this way. Because well, he is that kind of person!",
                [
                    "Positive",
                    0.1
                ]
            ],
            [
                "Kamala  could not  complete  even this mission",
                [
                    "Negative",
                    -0.05
                ]
            ],
            [
                "It doesn't take much working out after, Donald's automatic, self repairing, right ear! I know he has targeted the Republican voters as the dumbest of all? But this is the most blatant, piece of abuse of the American peoples, intelligence, ever!",
                [
                    "Positive",
                    0.11
                ]
            ],
            [
                "of course he wrote a note.....NOT    this has the smell of a now typical trump garbage set up.   trump has got to be brought to account.",
                [
                    "Negative",
                    -0.17
                ]
            ],
            [
                "Trying to change the conversation from the 1st (real) assassination attempt",
                [
                    "Positive",
                    0.2
                ]
            ],
            [
                "Mister Trump was not in danger at all.  It was again staged.   For grifting again and playing the victim",
                [
                    "Negative",
                    -0.08
                ]
            ],
            [
                "Sky News still saying \"Alleged\" even tho the FBI and Gunmen say it was an assassination attempt 🤣🤣🤣",
                [
                    "Negative",
                    -0.1
                ]
            ],
            [
                "The man can't even protect the border of his own golf course, let alone an entire country.",
                [
                    "Positive",
                    0.3
                ]
            ],
            [
                "\"Oh crap, they're not buying it, anyone got a peice of paper so we can write up a confession?\"\n\nYoure telling me he knew he was gonna fail months before he even did anything? And that his freind had a note of him admitting he was going to assassinate the president for months and yet did nothing?",
                [
                    "Negative",
                    -0.65
                ]
            ],
            [
                "why Ryan Routh tag of the Senator of the Philippines Risa Honteveros ?",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "so he wrote it weeks ago and knew he was gonna miss? i'm sorry but this smells of setup",
                [
                    "Negative",
                    -0.5
                ]
            ],
            [
                "Another nutty socialist.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "He is right, Trump is not fit to lead, the most powerful nation on earth, if pleads insanity he will be free.",
                [
                    "Positive",
                    0.26
                ]
            ],
            [
                "Dystopia",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Why he missed ? He was well organised,  they  scare in the end \nAnd make mistake  \nNEXT !!!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "It seems that citizens are stepping up against tyranny.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "No evidence of Hiraly  and Kamala  !!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Bullshit",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Inside job 😂",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Totally  agree with Ryan  trump isnt fit to be next president or FREELOCK HIM UP",
                [
                    "Positive",
                    0.13
                ]
            ],
            [
                "At least hes telling the truth along with mary Trump tells the truth about Donald Trump and fred Trump jr tells the truth about Donald Trump",
                [
                    "Negative",
                    -0.3
                ]
            ],
            [
                "Crazy Routh is smarter than Trump and Harris 😮",
                [
                    "Negative",
                    -0.6
                ]
            ],
            [
                "haha",
                [
                    "Positive",
                    0.2
                ]
            ]
        ],
        "srt":"keep walking this dramatic arrest of Ryan Ruth was the start of a multi- agency investigation to establish a motive to learn as much as possible about this second attempt on Donald Trump's life to find out if he was acting alone and this now forms a key part of the inquiry a letter written by Ryan Ruth and handed to a friend in the weeks before the assassination attempt seized by investigators and released now by the Department of Justice in an effort to prevent bail Dear World it reads this was an assassination attempt on Donald Trump but I am so sorry I have failed you I tried my best and gave it all the gumption I could muster it continues everyone across the globe from the youngest to the oldest know that Trump is unfit to be anything much less a US president this is where Ryan Ruth was allegedly lying in wait for the former president his gun pointing through the perimeter fence of the president's Palm Beach golf club the letter was found in a box along with ammunition four phones and other letters a Trump Tower here in New York his team are being kept up to date on the investigation and from the court documents we do now have quite a few new details that box where the letter was found was handed by Mr Ruth to an acquaintance of his in the months before the shooting and we know too that six phones were found in his car one of them had a search for the rout from Palm Beach to the Mexican border prosecutors have said that Ruth's rifle had a scope attached and an extended magazine allowing for more rounds it was loaded with 11 bullets with One in the Chamber ready to fire we need 100,000 people here fighting we know already that he had a particular focus on Ukraine and in the letter he hints at what he sees as Trump's foreign policy failures Ryan Ruth will remain in custody pending further proceedings the judge saying he finds the weight of evidence against the defendant to be strong the former president remains on the campaign Trail but secret services agents now steps away from him at all times Mark Stone Sky News in New York ",
        "positive_comments":26.67,
        "negative_comments":73.33,
        "sentiment":"Negative",
        "intensity":0.0
    },
    {
        "VideoID":"sSPzqcjE6Ms",
        "comments":[
            [
                "All these economists in the comments warning us the price of tractors will go up. \nOkay, first, John Deere would ALREADY be charging more if the market would bear it. Except they won’t because:\nConsumers will shift to more economically competitive products made by rival manufacturers rather than pay inflated prices. \nThat’s the idea. A 200% tariff forces John Deere to price its products so far above their market value that the company will have an economic incentive to move production back to the US. \nThe tariffs compensate for America’s higher labor cost and allow union workers to apply leverage to a corporate goon squad for once.",
                [
                    "Positive",
                    0.24
                ]
            ],
            [
                "Trump and anyone who supports him clearly does not understand economics. Look at the facts and his past record-  He's bankrupted multiple companies, added almost 8 trillion to the deficit, caused housing to go up 27.5%, and lost hundreds of thousands of jobs. He's unfit for office, but his followers don't care because he blows smoke up their rear, and they don't bother to look up facts and stats.",
                [
                    "Negative",
                    -0.05
                ]
            ],
            [
                "Juan Deere",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "That's great..John Deere SUCKS...\nNeed something diiferent",
                [
                    "Negative",
                    -0.3
                ]
            ],
            [
                "Trump is trying to help the farmers. He’s trying to keep the factories in the US.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "What a nutjob he is! And the fools vote for this guy?! 💙🇺🇸",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Republican presidential candidate Donald Trump has said that if reelected, he would impose new tariffs on China reaching 60 percent of the goods’ value. After Trump’s tariffs aimed at China in early 2018, retaliation from the country and other nations affected hit the U.S. economy and especially agricultural producers hard. A report from the USDA shows that between mid-2018 and the end of 2019, more than $27 billion, thereof $25.7 billion tied to China, had to be compensated with government payments to farmers. Tariff rates never exceeded 30 percent of goods value in that time period and were as low as 7.5 percent for some products, so an even higher and uniform tariff rate of 60 percent would be sure to send another shock wave through the U.S. business and farming communities.\n\nThank for destroy our food supply!! And make food more expensive!!",
                [
                    "Positive",
                    0.04
                ]
            ],
            [
                "Trump is a fool!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "He talks as though he is going to be installed",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Wait a minute if they've been making things in Mexico for 70 years.How come those certain things aren't much lower priced instead of higher than other manufacturers",
                [
                    "Positive",
                    0.13
                ]
            ],
            [
                "These \"tariffs\" only hurt the consumer. THEY pay for it, and the \"tariffs\" end up going in the government's pockets. Look at the aluminum tariffs. Who pays for more beer and soda ? China, the makers, or YOU ? You have been fooled by a guy who claims to be one of you.",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "I just wish one dang person would tell Trump how tariffs work. The leading GOP candidate for president doesnt understand how tariffs work. Its embarrassing.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "By Hook Or By Crook\n\nMost folks adhere to some form of moral standard. For some, this standard may be based on a religious or political belief. For others, this standard may simply be based on some form of acceptable social ethics. But some folks’ standards are not based on religion or politics or any form of acceptable ethics. Some folks’ moral standard is based on the adage, ‘by hook or crook.’ Which means ‘by any means necessary.’\nThis standard has been followed by pirates, gangsters, con artists, grifters, and thieves, of all stripes, since time immemorial. Those who follow it have been the bane of law-abiding, God-fearing, and morally upstanding people since people first formed into social groups. They have been feared, despised, hated, loved, admired, and emulated. They fill our police blotters, pulp fiction, action movies, and news broadcasts. They walk the streets of the hood, they haunt the halls of Congress, and they inhabit the boardrooms of big business. They may be your co-worker, next-door neighbor, or even a family member.\nIt is hard to say what kind of child, or when and how a child will pick up this standard of behavior. For some, it may be due to a form of trauma. For others, it may be due to how they are raised. For many, it is probably a combination of both. Donald Trump was raised by his father with this standard, and he, in turn, raised his children in the same way. His father taught him that the only thing that matters is winning and to win one has to be a killer. In other words, one has to win ‘by hook or by crook.’\nWhat does this mean? It means that all other standards of behavior, be they religious, political, or ethical in any socially acceptable way, are secondary. It implies that honesty, fairness, and compassion are seen as signs of weakness, while dishonesty, double-dealing, and cold-heartedness are seen as signs of strength.\nIn the world of the pirate, gangster, con artist, grifter, and thief, to outsmart, con, take, buffalo, hoodwink, or rip off the common citizen, mark, John, or sucker is not only a sign of success but confirmation of one’s superiority over the ordinary human being. Because at the core of a criminal’s cynical rationalizations and justifications for doing what they do is a belief that the ordinary human being is stupid and the moral beliefs and standards of ordinary human beings are foolish. And so, ordinary human beings deserve what they get.\nDonald Trump and his family carried these cynical rationalizations and justifications of the common criminal into their adult lives and the White House of the United States. And they succeeded, with the help of corrupt politicians, disgruntled Americans, and a foreign government, in pulling off one of the greatest political cons, economic heists, and social grifts in human history. The American People, the American economy, and the American political system were held hostage by a virtual gang of pirates who were busy ransacking the coffers of the American government and wrecking the American ship of state for as long as they could get away with it.\nBut finally, with the 2020 election, the American people woke up to what had happened, mustered all of the weapons the electoral system had to offer, and launched a full-frontal assault on these marauders that successfully drove them out of the White House.\nBut now, after the attack on our Capitol building by Trump supporters, the ending of Roe by Trump appointees to the Supreme Court, and with Trump running for the White House again, we must continue to resist, first by voting, then by continuing the Trump indictments. We must drive him and his sycophants out of government entirely because these pirates, gangsters, con artists, grifters, and thieves care nothing for the standards of our representative democracy that we value. They do not care about democracy and they have no business being involved in the management of our government. They will continue to ignore the rule of law and seek to satisfy their insatiable and prideful need to win ‘by hook or by crook’. And they will destroy our constitutional republic in the process if we let them. We must not let them.\n\nJRB",
                [
                    "Positive",
                    0.01
                ]
            ],
            [
                "Wouldn't that cut illegal immigration here?",
                [
                    "Negative",
                    -0.5
                ]
            ],
            [
                "Trump's tariff plan will be a disaster for farmers because John Deere will pass the extra costs to consumers, causing the price of John Deere equipment to skyrocket for U.S. farmers. Wall Street Journal, Goldman Sachs, and Wharton Business School have criticized these tariffs, warning they will hurt American consumers.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Just WOW! If you think grocery prices and inflation are bad now wait until this \"stable genius\" puts this plan into place. Vote for Harris and save yourselves from corrupt, greedy morons who wouldn't piss on any of us if we were on fire.",
                [
                    "Negative",
                    -0.47
                ]
            ],
            [
                "Trump said that he loves the poorly educated. This comment section shows why",
                [
                    "Negative",
                    -0.4
                ]
            ],
            [
                "Former President , and this is a fantastic idea !!! \nGreat Job Mr President 🇺🇸",
                [
                    "Positive",
                    0.53
                ]
            ],
            [
                "Trump gonna win😌",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Dump NAFTA NOW🇺🇸💪",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Outsource everything to mexico and china then we depend on them",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Do you know what tariffs are ? Another tactic in his “ playbook “, who ultimately pay for the tariffs?\n“ You can fool some people some of the time but you cannot fool all of the  people all the time “.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "John Deere has much bigger problems than Trump. They need to overhaul their entire repair philosophy and allow American farmers to repair their own tractors. Greed, greed, stockholder greed before the welfare of their customers.",
                [
                    "Positive",
                    0.15
                ]
            ],
            [
                "Trump is a complete moron he has never once had any kind of hard labor in his life 😆😆 I know Americans aren't that stupid to vote for him twice",
                [
                    "Negative",
                    -0.24
                ]
            ],
            [
                "❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤❤",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Current Ford powersteoke Diesel is Mexico vance is not the right fit i hope it doesn't bite mr Trump.... just unlock the software so ppl can repair ther own equipment i  hope you're information is accurate Sir.🇺🇲🗽⚖",
                [
                    "Positive",
                    0.34
                ]
            ],
            [
                "Maybe Deere should move manufacturing to where Maga hats are made.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Tell me you know NOTHING of how tariffs work by rambling about tariffs - HINT: They HURT the American people!!!!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Open borders just import the outsourcing. Vote America first.",
                [
                    "Positive",
                    0.12
                ]
            ],
            [
                "Big balls Trump!",
                [
                    "Negative",
                    0.0
                ]
            ]
        ],
        "srt":"Andrew. Thank you. Well, former President Trump has announced possible plans to hit John Deere with tariffs on Monday. Trump told a group of farmers deer could face major tariffs if the company outsources jobs to Mexico. I I just noticed behind me, John Deere tractors, I know a lot about John Deere. I love the company, but, uh, as you know, they've announced a few days ago that they're gonna move a lot of their manufacturing business to Mexico. I'm just, uh, notifying John Deere right now. If you do that, we're putting a 200% tariff on everything that you want to sell into the United States. So that if I win, John Deere is going to be paying a 200%. John Deere has directed questions about the announcement to a page on its website with the title John Deere's commitment to us manufacturing. Now, it says in order you see on your screen, in order to position our US factories to undertake these highly value additive activities, it is sometimes it is necessary to move less complex operations such as C assembly to other locations. This includes moving the production of some models of our skid steer loaders and compact loaders to our factory in Mexico, a facility that has been an important part of our global operation for nearly 70 years. ",
        "positive_comments":30.0,
        "negative_comments":70.0,
        "sentiment":"Positive",
        "intensity":0.07
    },
    {
        "VideoID":"uWpOxxhfG1Q",
        "comments":[
            [
                "Is this the woman that claims that she's an Indian???😂",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Stop the MAGA insanity. \n Vote Blue! 💙🇺🇸",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "He is the danger",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Well...I guess it's up to you....one and only one way to stop him is to vote!! I am from the Netetherlands and hope you do just that!!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "This is what cult leaders tell the women in the cults. Pray and obey. Keep sweet. Don't burden yourselves with decision making, let the men do it for you. What will be next? Stop working? Dress in a certain way? Don't drive cars? Don't go out without  a male family member? Five years in school are enough? I have the impression that could be the wet dream of all the weak whiny men who are afraid of women. Like trump. Shady Vance. And many more.",
                [
                    "Positive",
                    0.02
                ]
            ],
            [
                "I wanna know who wrote this for him. I almost think it has to be AI generated",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Is she still Native American?",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "There is a larger issue a stake!  They are chipping away at the very idea of personal liberty!!  Where will they deny rights next???!!!  Do not ask for whom the bell tolls, it tolls for thee!!!!!😮😮😮😮😮😮😮",
                [
                    "Positive",
                    0.05
                ]
            ],
            [
                "I'm pretty deaf but I heard women laughing at that obnoxious fool's comment...",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "Is it too late for another government coup?  Why are people so stupid about what happened? 0 votes!",
                [
                    "Negative",
                    -0.65
                ]
            ],
            [
                "Trump is very thick 😢😢😢😢. These poorly educated MAGAs are dangerous",
                [
                    "Negative",
                    -0.46
                ]
            ],
            [
                "the preditor telling the  victem  come to my house  i will look after you",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "So sick of Warren\n Retire",
                [
                    "Negative",
                    -0.71
                ]
            ],
            [
                "Pocahontas!!@@",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Yeah Donald Trump's not the government he is not even in the government",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Americans PLEASE stop talk about democracy until you change totally UNdemocratic election system! Not only cause of the electors BUT blunt inequality of voters which is KEY to democracy! You are really making idiots out of every voter from ''stronghold\" state wheter it's R or D! The RACE is close just because of it. In normal political system, Harris could already celebrate the win. Can't you see that? And you preach democracy to the rest of the world?",
                [
                    "Positive",
                    0.02
                ]
            ],
            [
                "How patronising of Trump. How patriarchal. Also a speech in contradiction of previous statements that everyone welcomed the overcoming of Roe-v Wade.",
                [
                    "Negative",
                    -0.17
                ]
            ],
            [
                "I showed this clip to my pets. They all knew Donnie was once the Creepy Commander-in-Chief!!",
                [
                    "Negative",
                    -0.78
                ]
            ],
            [
                "This is so friggin crazy . makes me ill . gross .",
                [
                    "Negative",
                    -0.37
                ]
            ],
            [
                "The only thing creepy is that democrats are voting for the same people that gave thier children myocarditis.",
                [
                    "Negative",
                    -0.17
                ]
            ],
            [
                "Women would rather live with the grim reaper than to have his protection!",
                [
                    "Negative",
                    -0.43
                ]
            ],
            [
                "Yes, you will be mine.\nTonight and every night\nI will be your knight in shining armor, coming to your emotional rrrrrrrrrescue.\nRiding across the desert . . . on a fine arab charger . . .",
                [
                    "Positive",
                    0.21
                ]
            ],
            [
                "Warren is right he's unhinged and creepy.",
                [
                    "Negative",
                    -0.11
                ]
            ],
            [
                "No soup for you! Come back, one year!",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "Agreed he's creepy!  He doesn't understand women at all",
                [
                    "Negative",
                    -0.62
                ]
            ],
            [
                "because once you turn 50 you no longer care about the freedoms you enjoyed when you could have kids or for your daughters who might need protection in the future. Geez women, didn’t you know that?!?!?",
                [
                    "Positive",
                    0.25
                ]
            ],
            [
                "I’m pretty sure women over 50 may have daughters that will want to have a choice of freedom to do what they decide to do with abortion, so, um, yea, I think they care about it. Just a thought. These people are stupid. Let’s look forward and turn the page to the next chapter. 💙",
                [
                    "Negative",
                    -0.01
                ]
            ],
            [
                "You're absolutely right he's very creepy",
                [
                    "Negative",
                    -0.18
                ]
            ],
            [
                "As donald says about school shooting....  you have just got to get over it. These things happen. It is what it is.",
                [
                    "Negative",
                    0.0
                ]
            ],
            [
                "How can women be healthy if you are killing them with your abortion ban Donald?",
                [
                    "Positive",
                    0.5
                ]
            ]
        ],
        "srt":">>> DONALD TRUMP IS HAVING A >>> DONALD TRUMP IS HAVING A TOUGH TIME WINNING OVER WOMEN. ACCORDING TO THE LATEST NBC'S NEWS POLLING, KAMALA HARRIS HOLDS A 21 POINT ADVANTAGE OVER TRUMP WITH FEMALE VOTERS. TRUMP IS ALSO DOWN 21 POINTS ON A KEY ISSUE THAT MATTERS TO A LOT OF AMERICAN WOMEN AND MEN AS WELL. 54% SAY KAMALA HARRIS WOULD BE BETTER THAN TRUMP ON ABORTION RIGHTS. NOW THE REPUBLICAN NOMINEE IS TRYING TO BRIDGE THIS VERY SERIOUS GULF BY BASICALLY TELLING WOMEN -- >> WE HAVE TO END THIS NATIONAL NIGHTMARE. BECAUSE I AM YOUR PROTECTOR. I WANT TO BE YOUR PROTECTOR. AS PRESIDENT I HAVE TO BE YOUR PROTECTOR. YOU WILL NO LONGER BE ABANDONED, LONELY OR SCARED. YOU WILL NO LONGER BE IN DANGER. YOU'RE NOT GOING TO BE IN DANGER ANY LONGER. YOU WILL NO LONGER HAVE ANXIETY FROM ALL OF THE PROBLEMS OUR COUNTRY HAS TODAY. WOMEN WILL BE HAPPY, HEALTHY, CONFIDENT AND FREE. YOU WILL NO LONGER BE THINKING ABOUT ABORTION. IT IS ALL THEY TALK ABOUT, ABORTION. >> JOINING ME NOW IS SENATOR ELIZABETH WARREN, DEMOCRAT OF MASSACHUSETTS. IT'S GOOD TO HAVE YOU ON THE PROGRAM. >> GOOD TO BE HERE. >> WELL, WHAT DO YOU THINK ABOUT THIS PITCH THAT DONALD TRUMP WILL BE YOUR PROTECTOR AND HE IS TALKING TO YOU AS AN AMERICAN WOMAN AND HE WILL PROTECT YOU SO WELL THAT YOU WON'T EVEN HAVE TO WORRY ABOUT ALL OF THIS POLITICS STUFF, LIKE ABORTION. >> THIS IS REALLY CREEPY. REALLY. THIS IS JUST CREEPY. THIS HAS THIS, YOU WILL BE HAPPY AND YOU WILL BE HAPPY DOING EXACTLY WHAT DONALD TRUMP AND HIS EXTREMIST FRIENDS HAVE DECIDED THAT YOU ARE ALLOWED TO DO. AND YOU KNOW, I HAVE TO SAY IT ACTUALLY FITS WITH THE WHOLE MINDSET OF SAYING DONALD TRUMP AND AN EXTREMIST BRANCH IN THIS COUNTRY WILL DECIDE WHO GETS ACCESS TO ABORTION, IVF, CONTRACEPTION. IT IS THIS, THEY WILL MAKE THE DECISIONS AND WOMEN, BLESS US, WILL SIMPLY SAY THANK YOU AND BE SO HAPPY ABOUT ALL OF IT. YOU KNOW I JUST WANT TO GIVE HIM A LITTLE ADVICE. THAT IS NOT HOW WE WORK. WOMEN ACTUALLY WANT TO MAKE OUR OWN DECISIONS AND IF WE CONSULT PEOPLE, WE WOULD LIKE TO BE THE ONES WHO DECIDE WHO WE CONSULT. THAT IT SHOULD NOT BE THE CASE THAT THE GOVERNMENT OR REALLY IT IS DONALD TRUMP AND A HANDFUL OF EXTREMISTS, COME IN AND DECIDE HEALTHCARE DECISIONS AND WHAT KIND OF MEDICAL CARE THAT WE WILL BE ABLE TO RECEIVE. IT IS. IT IS JUST CREEPY, CHRIS. >> ANTHONY COMSTOCK, AFTER WHOM THE COMSTOCK ACT IS NAMED SAW HIMSELF ALSO AS A PROTECTOR OF WOMEN. THAT LAW WHICH IS ESSENTIALLY STILL ON THE BOOKS AND THANKS TO TRUMP'S COURT COULD BE UTILIZED BY A JUSTICE DEPARTMENT ON DAY ONE AS THEY CALL FOR IN PROJECT 2025 TO CRIMINALIZE ABORTION AND CONTRACEPTION BEING MAILED ANYWHERE ON THE FIRST DAY. >> EXACT RIGHT AND REMEMBER J.D. VANCE HAS ALREADY WRITTEN A LETTER TO THE DEPARTMENT OF JUSTICE TELLING THE DEPARTMENT OF JUSTICE TO GET OUT AND ENFORCE THE COMSTOCK ACT AND TAKE AWAY ACCESS TO ABORTION TO EVERY PERSON IN THIS COUNTRY. NO MORE ACCESS AT ALL AND YOU KNOW THIS IS THE REMINDER, OBVIOUSLY, WHY WE NEED KAMALA HARRIS IN THE WHITE HOUSE, BUT ALSO WHY WE NEED DEMOCRATIC CONTROL OF CONGRESS AND\nPARTICULARLY DEMOCRATIC CONTROL PARTICULARLY DEMOCRATIC CONTROL OF THE SENATE. YOU'RE COVERING THE RACES HERE AND I AM SO GLAD YOU ARE ABOUT THIS, BUT THIS IS REALLY THE MOMENT. LOOK AT WHAT IS GOING ON AROUND THE COUNTRY WHERE MORE AND MORE PEOPLE ARE STANDING UP AND SAYING I CARE ABOUT THE ABORTION ISSUE. I CARE ABOUT BEING ABLE TO MAKE MY DECISION OR LETTING WOMEN MAKE THEIR DECISIONS. THIS WILL BE ON THE BALLOT IN FLORIDA AND IT MEANS IF THAT SENATE RACE IS INDIRECT CONTENTION. YOU ARE LOOKING FOR A RACE THAT YOU WANT TO SAY WHERE IS A POSSIBLE PICKUP FOR DEMOCRATS? IT WILL BE IN A PLACE LIKE FLORIDA WHERE PEOPLE ARE COMING TO THE POLLS TO BE ABLE TO VOTE, TO SAY WE WANT ACCESS TO ABORTION AND WHILE WE ARE HERE, WE WOULD LIKE TO HAVE A DEMOCRATIC SENATOR WHO ACTUALLY WOULD HELP KAMALA HARRIS PUT A WALL IN PLACE THAT MAKE SURE THERE IS NO COMSTOCK ACT AND THAT SOME REPUBLICAN PRESIDENT ON HIS OWN IN THE FUTURE CANNOT JUST WAVE HIS WAND AND GET RID OF ACCESS TO ABORTION. >> I WANT TO ASK A QUESTION ABOUT SENATE CANDIDATE BERNIE MORENO, RUNNING AGAINST HER COLLEAGUE IN OHIO AND HE SAID THIS AT A TOWN HALL WHICH I WANT TO PLAY FOR YOU, WHICH I THINK IS ACTUALLY WIDELY SHARED AMONG REPUBLICANS, WHICH IS HEAD-SCRATCHING, LIKE WHAT IS UP WITH THE OBSESSION WITH THE ABORTION THING? WHY DO THEY CARE SO MUCH? HE DOES NOT QUITE GET WHY WOMEN OVER 50 CARE ABOUT THE ISSUE. TAKE A LISTEN. >> SADLY BY THE WAY THERE ARE A LOT OF SUBURBAN WOMEN THAT ARE LIKE LISTEN, IF I CAN'T HAVE AN ABORTION WHENEVER I WANT, I WILL VOTE FOR ANYBODY ELSE, OKAY? HOLD ON. ESPECIALLY WOMEN THAT ARE LIKE PAST 50. >> WHAT DO YOU THINK OF THAT ONE? >> SO, THIS IS THE PLAN TO WIN VOTES FROM WOMEN? LOOK, AS I UNDERSTAND IT, THE PEOPLE OF OHIO HAVE SPOKEN ON THE QUESTION OF ABORTION AND THEY VOTED ON THIS LAST YEAR AND CAME TOGETHER AND SAID BY A PRETTY LARGE MAJORITY THAT THEY WANT TO HAVE ACCESS TO ABORTION AND THAT THEY REALLY DON'T WANT TO GO DOWN THIS PATH OF HAVING THE GOVERNMENT MAKE DECISIONS FOR THEM. BUT TO ME, THIS IS ALL THE SAME MINDSET ABOUT PEOPLE LIKE DONALD TRUMP JUST SAYING THAT THEY ARE THE ONES GOING TO MAKE THIS DECISION AND PATTING SWEET LITTLE WOMEN ON THE HEAD AND TELLING US WE ARE ALL GOING TO BE HAPPY WITH WHATEVER IT IS THAT THEY DECIDE. NEWSFLASH. WE ARE NOT GOING TO BE HAPPY ABOUT IT AND WE ARE NOT GOING TO GO ALONG WITH IT AT ALL. THAT IS WHY I THINK WE ARE BACKING UP KAMALA HARRIS AND BACKING UP DEMOCRATIC CONTROL OF THE SENATE AND BACKING UP DEMOCRATIC CONTROL OF THE HOUSE, BECAUSE THAT COMBINATION IS LITERALLY THE ONLY POSSIBLE WAY THAT WE CAN PROTECT ACCESS TO ABORTION. PROTECT ACCESS TO IVF, ALL ACROSS THIS COUNTRY. SO, YES, YES, YES, WE HAVE TO HELP KAMALA HARRIS, BUT ALSO WE HAVE TO HELP REPUBLICANS IN THE SENATE. FLORIDA MAYBE A PICKUP OPPORTUNITY. TEXAS IS LOOKING LIKE A PICKUP OPPORTUNITY AND DEFENDING OUR DEMOCRATS WHO ARE FIGHTING RIGHT NOW TO HANG ONTO THEIR SENATE SEATS. THAT IS OUR PATHWAY TO PROTECT ACCESS TO ABORTION IN RED STATES AND BLUE STATES, BECAUSE THOSE REPUBLICANS ARE MAKING IT CLEAR THEY ARE COMING FOR EVERYBODY. THEY WANT TO BAN ABORTION NATIONWIDE. THIS IS OUR CHANCE TO FIGHT BACK. >> AS YOU KNOW, COLIN ALLRED IS A DEMOCRATIC CANDIDATE IN ",
        "positive_comments":23.33,
        "negative_comments":76.67,
        "sentiment":"Positive",
        "intensity":0.19
    }
]