[
    {
        "tweet_url":"https:\/\/x.com\/nikhilkamathcio\/status\/1838877088444563835",
        "comments":[
            [
                "India stack is \"the\" platform to build upon, every young entrepreneur can benefit from this\n@NandanNilekani\n \n\n#10YearsOfMakeInIndia",
                [
                    "Positive",
                    0.76
                ]
            ],
            [
                "India has a lot of potential to grow, which is clear from the rising investments and GDP. \n\nIt’s a great place to start and run new businesses.",
                [
                    "Positive",
                    0.89
                ]
            ],
            [
                "How about Detivatives Trading as a business?",
                [
                    "Negative",
                    0.41
                ]
            ],
            [
                "The potential is limitless, when young entreprenuers have such kind of resources and determination!",
                [
                    "Negative",
                    0.49
                ]
            ],
            [
                "Yes correct said we wants a platform",
                [
                    "Positive",
                    0.49
                ]
            ],
            [
                "Young  entrepreneurs need to go out of Box",
                [
                    "Positive",
                    0.51
                ]
            ],
            [
                "How about healthcare digital stack?",
                [
                    "Negative",
                    0.41
                ]
            ]
        ],
        "positive_comments":57.14,
        "negative_comments":42.86
    },
    {
        "tweet_url":"https:\/\/x.com\/nikhilkamathcio\/status\/1838171560479498465",
        "comments":[
            [
                "The current thesis I have… thesis, passion, fascination, is to watch Indian startups kill it in today’s ecosystem. I hope that a lot of the companies we support will retell the Indian story, the real one, without any baggage from the past. It's our decade. \n@TheWTFund\n is India’s premier non-dilutive grant fund for emerging entrepreneurs under 25. Through the 1st Cohort (C1\/24), 9 startups with 15 young founders under the age of 25, were shortlisted and these are some of the coolest ones we discovered.. \n\nThe second cohort applications are now open: http:\/\/allthingswtf.com\/wtfund",
                [
                    "Positive",
                    0.55
                ]
            ],
            [
                "I love how \n@TheWTFund\n is giving young Indian founders the platform they deserve.\n\nNon-dilutive grants are a game-changer, especially for emerging entrepreneurs with fresh ideas. It’s our decade to redefine the narrative!",
                [
                    "Positive",
                    0.83
                ]
            ],
            [
                "Exciting to see \n@TheWTFund\n supporting young entrepreneurs under 25! Imagine building a unified MaaS platform that integrates all modes of transport, helping users manage domestic and international travel seamlessly. With proper funding, Indian startups can redefine mobility and",
                [
                    "Positive",
                    0.95
                ]
            ],
            [
                "The future belongs to India! This is the dawn of its decade and its century.\n\nBuilding exceptional products is the key to India's success this century!",
                [
                    "Positive",
                    0.66
                ]
            ]
        ],
        "positive_comments":100.0,
        "negative_comments":0.0
    },
    {
        "tweet_url":"https:\/\/x.com\/nikhilkamathcio\/status\/1836791725349614024",
        "comments":[
            [
                "The last 4 times I turned on my TV, I shut ott(Netflix,Prime etc) and switched to YouTube twice, something is changing.\nThoughts?",
                [
                    "Negative",
                    0.62
                ]
            ],
            [
                "No thoughts man…sometimes it’s okay to watch whatever you want without much thoughts",
                [
                    "Negative",
                    0.3
                ]
            ],
            [
                "When Netflix or Prime refuse to sign your options trading documentary, but YouTube airs your podcast, it's common to switch from OTT to YouTube",
                [
                    "Negative",
                    0.44
                ]
            ],
            [
                "Ye to kuch bhi nai hai. \n\nIt’s been 8 months many traders have not opened zerodha because of your glitches ! \n\nSomething is changing",
                [
                    "Negative",
                    0.63
                ]
            ],
            [
                "Attention span simple!! \n\nA 10\/20 mins content outwieghs a 50 min episode or a 120-180 mins movie!!",
                [
                    "Positive",
                    0.69
                ]
            ],
            [
                "YouTube knows what you want to watch based on your web activities and it shows those content only and is personalized. As a result you end up watching YouTube.\n\nHowever OTT suggestions is customised but common for all.",
                [
                    "Positive",
                    0.38
                ]
            ],
            [
                "Similar to people switching from Zerodha to other brokers, the gap in quality is getting closed down due to competition.",
                [
                    "Negative",
                    0.61
                ]
            ],
            [
                "Typical youtuber behaviour",
                [
                    "Negative",
                    0.46
                ]
            ],
            [
                "Similar content on OTT in India, you will not have much there if you are not a fond of fiction, meanwhile YouTube gives us an impression of knowledge and information, we are always open to know something new, hence, YouTube gives us a lot of options.",
                [
                    "Positive",
                    0.49
                ]
            ],
            [
                "I will give you three:\n\n1. OTT is low quality abusive content\n2. Less variety and choice\n\nBiggest thing:\n\n3. OTT doesn't have the social element and raw feel",
                [
                    "Negative",
                    0.37
                ]
            ]
        ],
        "positive_comments":30.0,
        "negative_comments":70.0
    }
]